src/toir_cf/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>InformationRegister.торо_ГарантийностьРемонтов</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>AccumulationRegister.торо_РецидивныеДефекты</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КрайнееВремяУстранения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ТипЗаказа</name>
    <type>
      <types>EnumRef.проф_ТипЗаказаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_РемБаза</name>
    <type>
      <types>CatalogRef.проф_ПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_Наработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_ЭксплуатацияВозможна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КраткоеОписаниеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_ПолноеОписаниеДефекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_РешениеПоУстранению</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписаниеЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписаниеЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефектаЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефектаЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранениеЯзык1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранениеЯзык2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>проф_Подписанты</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.проф_РолиПодписантов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/InformationRegisters/торо_СтатусыРемонтов/торо_СтатусыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыРемонтов</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_СтатусыРемонтов/торо_СтатусыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыРемонтов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>проф_КВыполнению</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаЖурналаДефектов/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьЖурналДефектов(Команда)
	
	Отказ = Ложь;

	Если ЗначениеЗаполнено(НачПериода) Тогда
		Если НЕ ЗначениеЗаполнено(КонПериода) Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо заполнить дату окончания периода.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли КонПериода < НачПериода Тогда
			ТекстСообщения = НСтр("ru = 'Дата окончания периода меньше даты его начала.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(КонПериода) Тогда
		Если НЕ ЗначениеЗаполнено(НачПериода) Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо заполнить дату начала периода.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли КонПериода < НачПериода Тогда
			ТекстСообщения = НСтр("ru = 'Дата окончания периода меньше даты его начала.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;		
 	Результат=ПолучитьСписокДефектов();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЖурналаДефектов(Команда)
	
	СформироватьЖурналДефектов(Неопределено);
	Результат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДоступныхСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора();
	ПараметрыОтбора = Новый Структура("СписокСтатусов", СписокДоступныхСтатусов);	
	ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", ПараметрыОтбора, Элемент,,
		ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокДефектов()		
	
		ТабДок = Результат;
		ТабДок.Очистить();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ЖурналДефектов");
		// Заголовок
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТабДок.Вывести(Область);
		
		// Отбор
		ВывестиОбласть = Ложь;
		Область = Макет.ПолучитьОбласть("Отбор");
		Если ЗначениеЗаполнено(Организация) Тогда
			ВывестиОбласть					= Истина;		
			Область.Параметры.Организация	= торо_ЗаполнениеДокументов.ПолучитьПредставлениеОрганизацииДляПечати(Организация);;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			ВывестиОбласть								= Истина;
			Область.Параметры.ПодразделениеОрганизации	= ПодразделениеОрганизации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОР) Тогда
			ВывестиОбласть			= Истина;
			Область.Параметры.ОР	= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
			ВывестиОбласть			= Истина;
			Область.Параметры.Дата	= "Период с: " + НачПериода + " по: " + КонПериода;
		КонецЕсли;
		
		Если ВывестиОбласть Тогда
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		Запрос = Новый Запрос();		
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_СтатусыРемонтовСрезПоследних.IDРемонта КАК IDРемонта,
		               |	торо_СтатусыРемонтовСрезПоследних.Период КАК Период,
		               |	торо_СтатусыРемонтовСрезПоследних.Регистратор КАК Регистратор,
		               |	торо_СтатусыРемонтовСрезПоследних.НомерСтроки КАК НомерСтроки,
		               |	торо_СтатусыРемонтовСрезПоследних.Активность КАК Активность,
		               |	торо_СтатусыРемонтовСрезПоследних.Статус КАК Статус
		               |ПОМЕСТИТЬ ВТ_СтатусыРемонтов
		               |ИЗ
		               |	РегистрСведений.торо_СтатусыРемонтов.СрезПоследних КАК торо_СтатусыРемонтовСрезПоследних
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
		               |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
		               |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		               |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
		               |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ДефектПричина,
		               |	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
		               |	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта КАК ПоследствияДефекта,
		               |	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение КАК НаправлениеНаУстранение,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация КАК Организация,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный КАК Ответственный,
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение КАК Подразделение,
		               |	ВЫБОР
		               |		КОГДА ВТ_СтатусыРемонтов.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыРемонтов.Выполнен)
		               |			ТОГДА ""Устранен""
		               |		ИНАЧЕ ""Не устранен""
		               |	КОНЕЦ КАК Устранен,
		               |	ВТ_СтатусыРемонтов.Статус КАК СостояниеРабот
		               |ИЗ
		               |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыРемонтов КАК ВТ_СтатусыРемонтов
		               |		ПО торо_ВыявленныеДефектыСписокДефектов.ID = ВТ_СтатусыРемонтов.IDРемонта
		               |ГДЕ
		               |	((НЕ &ИспользоватьОтборПоОрганизации
		               |				ИЛИ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация = &Организация)
					   |				И (НЕ &ИспользоватьОтборПоПодразделению
		               |					ИЛИ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение)
		               |				И (НЕ &ИспользоватьОтборПоОбъектуРемонта
		               |					ИЛИ торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта)
		               |				И торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения >= &ДатаНачала
		               |				И (торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения <= &ДатаОкончания
		               |					ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		               |				И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
		               |				И (&ОтборПоСтатусуДефекта
		               |				ИЛИ ВТ_СтатусыРемонтов.Статус = &Статус))
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения";	
		
		// СписокДефектов
		Область = Макет.ПолучитьОбласть("СписокДефектовШапка");
		ТабДок.Вывести(Область);
		ОбластьСписокДефектов = Макет.ПолучитьОбласть("СписокДефектов");
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоОрганизации", ЗначениеЗаполнено(Организация));
		
		Запрос.УстановитьПараметр("ОбъектРемонта", ОР);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоОбъектуРемонта", ЗначениеЗаполнено(ОР));
		
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("ИспользоватьОтборПоПодразделению", ЗначениеЗаполнено(ПодразделениеОрганизации));
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонПериода));
		
		Запрос.УстановитьПараметр("ОтборПоСтатусуДефекта", НЕ ЗначениеЗаполнено(ОтборПоСтатусу));
		Запрос.УстановитьПараметр("Статус", ОтборПоСтатусу);
			
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗапроса.Следующий() Цикл 
			ОбластьСписокДефектов.Параметры.Заполнить(ВыборкаЗапроса);
			ОбластьСписокДефектов.Параметры.ОбъектРемонтаПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаЗапроса.ОбъектРемонта);
			ОбластьСписокДефектов.Параметры.ОтказавшийЭлементПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ВыборкаЗапроса.ОтказавшийЭлемент);
			ТабДок.Вывести(ОбластьСписокДефектов);
		КонецЦикла;
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		// Зададим параметры макета
		ТабДок.ПолеСверху         = 0;
		ТабДок.ПолеСлева          = 0;
		ТабДок.ПолеСнизу          = 0;
		ТабДок.ПолеСправа         = 0;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб  = ИСТИНА;
		
		Возврат ТабДок;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		КонПериода = Параметры.ПараметрыОтбора.КонПериода;
		НачПериода = Параметры.ПараметрыОтбора.НачПериода;
		ОР = Параметры.ПараметрыОтбора.ОР;
		Организация = Параметры.ПараметрыОтбора.Организация;
		ПодразделениеОрганизации = Параметры.ПараметрыОтбора.ПодразделениеДляДок;
	Иначе 
		НачПериода = НачалоГода(ТекущаяДата());
		КонПериода = КонецГода(ТекущаяДата());
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновнаяОрганизация",Истина);
		ПодразделениеОрганизации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновноеПодразделение",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
